
# Practice SQL with `pandas`, Pt. 1


---

## Review: `pandas` and SQL


### The `pandas` Connector and Functions for SQL

We can leverage SQL through `pandas` using the `pandas.io.sql` module:

```python
import pandas as pd
from pandas.io import sql
```


#### Sql.read_sql(sql, con[, index_col, ...])
- Reads a SQL query or database table into a DataFrame.


#### DataFrame.to_sql(name, con[, flavor, ...])
- Writes records stored in a DataFrame to a SQL database.

### What basic sql operators have we learned?

We're going to be reading data into pandas from CSVs, and writing them out to sqlite databases.  

So first let's just read in the data

In [81]:
import pandas as pd
car_names = pd.read_csv('../datasets/csv/car-names.csv', encoding = 'utf-8')
# Checking what our DataFrame looks like.
car_names.head(3)

   Id        Model                         Make
0   1  'chevrolet'  'chevrolet chevelle malibu'
1   2      'buick'          'buick skylark 320'
2   3   'plymouth'         'plymouth satellite'

### Creating the sqlite connection

We need to specify into which database we want out tables written.  To do this, we set up the connection.

**If no database exists, our command will create one.**

*Keep in mind that the directory your notebook opens is its base directory for all future SQL actions.*

```python
connection = sqlite3.connect('./datasets/sql/Cars.db.sqlite')
```

In [82]:
from pandas.io import sql
import sqlite3
connection = sqlite3.connect('../datasets/sql/Cars.db.sqlite')

#### Convert the loaded `.csv` to a SQL file.  
Because DataFrames are similar to SQL tables, you can now read and convert a `pandas` DataFrame named `car_names` into a SQL table in the newly created SQLite database above.

```python
car_names.to_sql(name = 'car_names', con = connection, if_exists = 'replace', index = False)
```

Important `.to_sql` arguments include:
- `name`: The name of the table; useful if you have multiple tables in a SQL database.
- `con`: The connection path to where the data should be placed.
- `if_exists`: The condition to pass if the table already exists.

In [83]:
# Converts a DataFrame into a SQL database.
car_names.to_sql(name = 'car_names', con = connection, if_exists = 'replace', index = False)

# if you check that directory, you should see the database file

> **Note:** If you wanted a temporary SQL database, using the command below would allow you to access a database store in memory (RAM) as opposed to in storage.

``` python
conn = sqlite3.connect(':memory:')
```

### Let's create a second table in the same database

The table should be called `car_makers`.

In [84]:
car_makers_csv = '../datasets/csv/car-makers.csv'

# Creating a table for order breakdowns.
makers = pd.read_csv(car_makers_csv, encoding = 'utf-8')

makers.to_sql(name = 'car_makers', con = connection, if_exists = 'replace', index = False)

# note that it's the same connection because we're working in the same database

###  Create a third table in the `cars` database for the car data.

The table should be called `car_data`.  Try this yourselves.

In [85]:
car_data_csv = '../datasets/csv/cars-data.csv'

# Creating a table for the sales targets.
data = pd.read_csv(car_data_csv, encoding = 'utf-8')

data.to_sql(name = 'car_data', con = connection, if_exists = 'replace', index = False)

### Let's now read the entire `car_names` table from your SQL database into a DataFrame.

Reading into a DataFrame with a query string can be accomplished using:
```python
# Use `read_sql` from the `pandas` SQL library and set it equal to a DF object.
cars = sql.read_sql(query_string, con = connection)
```

In [86]:
# This is our SQL query:
query = 'select * from car_names'

# Use `read_sql` from the `pandas` SQL library and set it equal to a DF object:
results = sql.read_sql(query, con = connection)

results.head()

   Id        Model                         Make
0   1  'chevrolet'  'chevrolet chevelle malibu'
1   2      'buick'          'buick skylark 320'
2   3   'plymouth'         'plymouth satellite'
3   4        'amc'              'amc rebel sst'
4   5       'ford'                'ford torino'

## Side Note: Normalized vs. Denormalized Databases

---

There are several ways to organize data in a relational database. Two common definitions for data set ups are **normalized** and **denormalized**.

- __Normalized__ structures include a single table per entity and use many foreign keys or link tables to connect entities together.

- __Denormalized__ tables have fewer tables and may (for example) place all of the tweets and user information in one table.

Each style has its own advantages and disadvantages. 

- Denormalized tables duplicate a lot of information. For example, in a combined tweets/users table, we may store the address of each user. Now, instead of storing this once per user, we are storing it once per tweet!
- However, this makes the data easy to access if we ever need to find the tweet _and_ the user's location.

- Normalized tables save the storage space by separating the information. 
- However, if we ever need to access two pieces of information at once — like in our example — we would need to join the corresponding tables, which can take more time.

### Let's write a Python function to query a database using `pandas` and return a DataFrame.

The function should take two arguments:
- The query string
- The database connection object

In [87]:

CARS = sqlite3.connect('../datasets/sql/Cars.db.sqlite')

def Q(query, db=CARS):
    return sql.read_sql(query, db)

>Check: what would happen if I omitted the first argument?  What about the second?

Select the first five rows of the `car_names` table.

> **Hint**: The LIMIT command in SQL can limit the number of rows returned.

In [88]:
Q('select * from car_names limit 5')

   Id        Model                         Make
0   1  'chevrolet'  'chevrolet chevelle malibu'
1   2      'buick'          'buick skylark 320'
2   3   'plymouth'         'plymouth satellite'
3   4        'amc'              'amc rebel sst'
4   5       'ford'                'ford torino'

### Let's add some more cars into the `car_names` table.

The `.execute()` function will come in handy here, executing a SQL command string.
```python
connection.execute()
```

In [89]:
ferrari = (None, 'Ferrari','The Ferrari')
tesla = [None, 'Tesla', None]

In [90]:
CARS.execute('INSERT INTO car_names VALUES (?, ?, ?)', ferrari)
CARS.execute('INSERT INTO car_names VALUES (?, ?, ?)',tesla)

In [91]:
Q('SELECT * FROM car_names').tail()

        Id        Model             Make
403  404.0      'dodge'  'dodge rampage'
404  405.0       'ford'    'ford ranger'
405  406.0  'chevrolet'     'chevy s-10'
406    NaN      Ferrari      The Ferrari
407    NaN        Tesla             None

### Query the `car_names` table for all columns where `'Model' = 'Tesla.'`

In [92]:
Q('SELECT * FROM car_names WHERE "Model" = "Tesla"')

     Id  Model  Make
0  None  Tesla  None

## Side note: capitalization....

Why is "Model" capitalized?  Would it work without it?

In [93]:
Q('SELECT * FROM car_names WHERE model = "Tesla"')

     Id  Model  Make
0  None  Tesla  None

### Select the first five rows of the `car_makers` table.

In [94]:
Q('select * from car_makers limit 5')

   Id         Maker                  FullName Country
0   1         'amc'  'American Motor Company'       1
1   2  'volkswagen'              'Volkswagen'       2
2   3         'bmw'                     'BMW'       2
3   4          'gm'          'General Motors'       1
4   5        'ford'      'Ford Motor Company'       1

### Select the first five rows of the `car_data` table.

In [95]:
Q('select * from car_data limit 5')

   Id MPG  Cylinders  Edispl Horsepower  Weight  Accelerate  Year
0   1  18          8   307.0        130    3504        12.0  1970
1   2  15          8   350.0        165    3693        11.5  1970
2   3  18          8   318.0        150    3436        11.0  1970
3   4  16          8   304.0        150    3433        12.0  1970
4   5  17          8   302.0        140    3449        10.5  1970

## SQL JOIN Types

---

SQL JOINs are used when data is spread out in different tables. A JOIN operation allows us to combine rows from two or more tables in a single new table. In order for this to be possible, a common field need to exists between the tables.

JOIN operations can be considered operations between two sets in which records with the same key are combined and records missing in one set are either discarded or included as NULL values.

YOU HAVE SEEN THIS BEFORE!!  WHERE?

![join types](../images/joins.gif)

JOIN types include:
- **INNER JOIN:** Returns all rows where there is at least one match in BOTH tables.
- **LEFT JOIN:** Returns all rows from the left table and matched rows from the right table.
- **RIGHT JOIN:** Returns all rows from the right table and matched rows from the left table.
- **FULL JOIN:** Returns all rows where there is a match in ONE of the tables.

![sql join types](../images/sql-joins.jpeg)

### In our example, we can use Order ID as the matching feature to perform merges.

Let's check out all of the ways we can merge these tables.

### Practice INNER JOINs

The most common type of JOIN is `SQL INNER JOIN` (SIMPLE JOIN). A `SQL INNER JOIN` returns all rows from multiple tables in which the JOIN condition is met. 

If we `INNER JOIN` on `Id`, it takes the intersection of the two tables, excluding the rows for which `CustomerID` is NULL in EITHER of the two tables.

Essentially, only matching pairs of Order IDs from both data sets will be returned.

In [96]:
# Why doesn't this work?
inner_join = Q('SELECT "Make", "MPG", "Horsepower", "Year" '
'FROM car_names '
'INNER JOIN car_data '
'ON "Id"')
inner_join.head()

DatabaseError: Execution failed on sql 'SELECT "Make", "MPG", "Horsepower", "Year" FROM car_names INNER JOIN car_data ON "Id"': ambiguous column name: Id

In [97]:
inner_join = Q('SELECT car_names."Make", car_data."MPG", car_data."Horsepower", car_data."Year" '
'FROM car_names '
'INNER JOIN car_data '
'ON car_names."Id" = car_data."Id"')
inner_join.head()

                          Make MPG Horsepower  Year
0  'chevrolet chevelle malibu'  18        130  1970
1          'buick skylark 320'  15        165  1970
2         'plymouth satellite'  18        150  1970
3              'amc rebel sst'  16        150  1970
4                'ford torino'  17        140  1970

In [98]:
# will this work?  under what circumstances?
# inner_join = Q('SELECT "Make", "MPG", "Horsepower", "Year" '
# 'FROM car_names '
# 'INNER JOIN car_data '
# 'ON car_names."Id" = car_data."Id"')
# inner_join.head()

### Practice LEFT JOINs

The `LEFT JOIN` keyword returns all rows from the left table (`table1`), along with matching rows in the right table (`table2`). When there is no match, the result is NULL on the right side.

**Select `Make`, `MPG`, `Horsepower`, and `Year`**.
- `SELECT FROM` the `car_names` table.
- `LEFT JOIN` the `car_data` table by `Id`.

In [99]:
left_join = Q('SELECT car_names."Make", car_data."MPG", car_data."Horsepower", car_data."Year" '
'FROM car_names '
'LEFT JOIN car_data '
'ON car_names."Id"=car_data."Id"')
left_join

                                    Make   MPG Horsepower  Year
0            'chevrolet chevelle malibu'    18        130  1970
1                    'buick skylark 320'    15        165  1970
2                   'plymouth satellite'    18        150  1970
3                        'amc rebel sst'    16        150  1970
4                          'ford torino'    17        140  1970
5                     'ford galaxie 500'    15        198  1970
6                     'chevrolet impala'    14        220  1970
7                    'plymouth fury iii'    14        215  1970
8                     'pontiac catalina'    14        225  1970
9                   'amc ambassador dpl'    15        190  1970
10                'citroen ds-21 pallas'  null        115  1970
11    'chevrolet chevelle concours (sw)'  null        165  1970
12                    'ford torino (sw)'  null        153  1970
13             'plymouth satellite (sw)'  null        175  1970
14                  'amc rebel sst (sw)'  null        175  1970
15                 'dodge challenger se'    15        170  1970
16                   'plymouth cuda 340'    14        160  1970
17               'ford mustang boss 302'  null        140  1970
18               'chevrolet monte carlo'    15        150  1970
19             'buick estate wagon (sw)'    14        225  1970
20               'toyota corona mark ii'    24         95  1970
21                     'plymouth duster'    22         95  1970
22                          'amc hornet'    18         97  1970
23                       'ford maverick'    21         85  1970
24                        'datsun pl510'    27         88  1970
25        'volkswagen 1131 deluxe sedan'    26         46  1970
26                         'peugeot 504'    25         87  1970
27                         'audi 100 ls'    24         90  1970
28                            'saab 99e'    25         95  1970
29                            'bmw 2002'    26        113  1970
..                                   ...   ...        ...   ...
376           'chevrolet cavalier wagon'    27         88  1982
377          'chevrolet cavalier 2-door'    34         88  1982
378         'pontiac j2000 se hatchback'    31         85  1982
379                     'dodge aries se'    29         84  1982
380                    'pontiac phoenix'    27         90  1982
381               'ford fairmont futura'    24         92  1982
382                     'amc concord dl'    23       null  1982
383                'volkswagen rabbit l'    36         74  1982
384                 'mazda glc custom l'    37         68  1982
385                   'mazda glc custom'    31         68  1982
386             'plymouth horizon miser'    38         63  1982
387                     'mercury lynx l'    36         70  1982
388                   'nissan stanza xe'    36         88  1982
389                       'honda accord'    36         75  1982
390                     'toyota corolla'    34         70  1982
391                        'honda civic'    38         67  1982
392                 'honda civic (auto)'    32         67  1982
393                      'datsun 310 gx'    38         67  1982
394              'buick century limited'    25        110  1982
395  'oldsmobile cutlass ciera (diesel)'    38         85  1982
396         'chrysler lebaron medallion'    26         92  1982
397                     'ford granada l'    22        112  1982
398                   'toyota celica gt'    32         96  1982
399                  'dodge charger 2.2'    36         84  1982
400                   'chevrolet camaro'    27         90  1982
401                    'ford mustang gl'    27         86  1982
402                          'vw pickup'    44         52  1982
403                      'dodge rampage'    32         84  1982
404                        'ford ranger'    28         79  1982
405                         'chevy s-10'    31         82  1982

[406 rows x 4 columns]

###  RIGHT JOINs and FULL OUTER JOINs 

> **Note:** We haven't included exercises for RIGHT and FULL OUTER JOINs, because they are not supported in this example.

The `RIGHT JOIN` keyword would join all rows from the right table (`table2`) with the matching rows in the left table (`table1`). The result is NULL on the left side when there is no match.

>Check: on the whole, people use `RIGHT JOIN` almost never.  Why?

The `FULL OUTER JOIN` keyword returns all rows from the left table (`table1`) and the right table (`table2`). This JOIN combines results from both `LEFT` and `RIGHT` JOINs and all information from both tables into one. You can imagine that this can involve lots of repetitious information and/or NULL values.

## Addtional Resources

---

These resources are a bit long-winded but are good for explaining `pandas` functions from a SQL programmer's perspective:

- [Pydata Video](https://www.youtube.com/watch?v=1uVWjdAbgBg)  
- [Associated GitHub Repo](https://github.com/gjreda/pydata2014nyc/tree/master/data)
- [`pandas` Merge, JOIN, and Concatenate](http://pandas.pydata.org/pandas-docs/stable/merging.html)

## Independent Practice:

- select the MPG, Horspower and Weight columns for cars built in 1970
- return the average horsepower for cars with 8 cylinders
- return a list of Makes for cars produced after 1980


### For these, also do in pandas and check against your SQL queries

In [100]:
# select the MPG, Horspower and Weight columns for cars built in 1970
Q('select MPG, Horsepower, Cylinders from car_data where Year = 1970')

     MPG Horsepower  Cylinders
0     18        130          8
1     15        165          8
2     18        150          8
3     16        150          8
4     17        140          8
5     15        198          8
6     14        220          8
7     14        215          8
8     14        225          8
9     15        190          8
10  null        115          4
11  null        165          8
12  null        153          8
13  null        175          8
14  null        175          8
15    15        170          8
16    14        160          8
17  null        140          8
18    15        150          8
19    14        225          8
20    24         95          4
21    22         95          6
22    18         97          6
23    21         85          6
24    27         88          4
25    26         46          4
26    25         87          4
27    24         90          4
28    25         95          4
29    26        113          4
30    21         90          6
31    10        215          8
32    10        200          8
33    11        210          8
34     9        193          8

In [114]:
data[data['Year']==1970][['MPG', 'Horsepower', 'Cylinders']]

     MPG Horsepower  Cylinders
0     18        130          8
1     15        165          8
2     18        150          8
3     16        150          8
4     17        140          8
5     15        198          8
6     14        220          8
7     14        215          8
8     14        225          8
9     15        190          8
10  null        115          4
11  null        165          8
12  null        153          8
13  null        175          8
14  null        175          8
15    15        170          8
16    14        160          8
17  null        140          8
18    15        150          8
19    14        225          8
20    24         95          4
21    22         95          6
22    18         97          6
23    21         85          6
24    27         88          4
25    26         46          4
26    25         87          4
27    24         90          4
28    25         95          4
29    26        113          4
30    21         90          6
31    10        215          8
32    10        200          8
33    11        210          8
34     9        193          8

In [35]:
# return the average horsepower for cars with 8 cylinders

Q('select AVG(Horsepower) from car_data where Cylinders = 8')

   AVG(Horsepower)
0       158.453704

In [127]:

data[data['Cylinders']==8]['Horsepower'].astype(float).mean()

158.4537037037037

In [201]:

Q('select Make from car_data left join car_names on car_data.Id = car_names.Id Where Year > 1980')

                                   Make
0                    'plymouth reliant'
1                       'buick skylark'
2              'dodge aries wagon (sw)'
3                  'chevrolet citation'
4                    'plymouth reliant'
5                      'toyota starlet'
6                      'plymouth champ'
7                    'honda civic 1300'
8                              'subaru'
9                      'datsun 210 mpg'
10                      'toyota tercel'
11                        'mazda glc 4'
12                 'plymouth horizon 4'
13                     'ford escort 4w'
14                     'ford escort 2h'
15                   'volkswagen jetta'
16                        'renault 18i'
17                      'honda prelude'
18                     'toyota corolla'
19                       'datsun 200sx'
20                          'mazda 626'
21          'peugeot 505s turbo diesel'
22                          'saab 900s'
23                       'volvo diesel'
24                    'toyota cressida'
25                  'datsun 810 maxima'
26                      'buick century'
27              'oldsmobile cutlass ls'
28                    'ford granada gl'
29             'chrysler lebaron salon'
..                                  ...
31           'chevrolet cavalier wagon'
32          'chevrolet cavalier 2-door'
33         'pontiac j2000 se hatchback'
34                     'dodge aries se'
35                    'pontiac phoenix'
36               'ford fairmont futura'
37                     'amc concord dl'
38                'volkswagen rabbit l'
39                 'mazda glc custom l'
40                   'mazda glc custom'
41             'plymouth horizon miser'
42                     'mercury lynx l'
43                   'nissan stanza xe'
44                       'honda accord'
45                     'toyota corolla'
46                        'honda civic'
47                 'honda civic (auto)'
48                      'datsun 310 gx'
49              'buick century limited'
50  'oldsmobile cutlass ciera (diesel)'
51         'chrysler lebaron medallion'
52                     'ford granada l'
53                   'toyota celica gt'
54                  'dodge charger 2.2'
55                   'chevrolet camaro'
56                    'ford mustang gl'
57                          'vw pickup'
58                      'dodge rampage'
59                        'ford ranger'
60                         'chevy s-10'

[61 rows x 1 columns]

In [202]:
pd.merge(data, car_names, how='left')[pd.merge(data, car_names, how='left')['Year']>1980]["Make"]

345                     'plymouth reliant'
346                        'buick skylark'
347               'dodge aries wagon (sw)'
348                   'chevrolet citation'
349                     'plymouth reliant'
350                       'toyota starlet'
351                       'plymouth champ'
352                     'honda civic 1300'
353                               'subaru'
354                       'datsun 210 mpg'
355                        'toyota tercel'
356                          'mazda glc 4'
357                   'plymouth horizon 4'
358                       'ford escort 4w'
359                       'ford escort 2h'
360                     'volkswagen jetta'
361                          'renault 18i'
362                        'honda prelude'
363                       'toyota corolla'
364                         'datsun 200sx'
365                            'mazda 626'
366            'peugeot 505s turbo diesel'
367                            'saab 900s'
368                         'volvo diesel'
369                      'toyota cressida'
370                    'datsun 810 maxima'
371                        'buick century'
372                'oldsmobile cutlass ls'
373                      'ford granada gl'
374               'chrysler lebaron salon'
                      ...
376             'chevrolet cavalier wagon'
377            'chevrolet cavalier 2-door'
378           'pontiac j2000 se hatchback'
379                       'dodge aries se'
380                      'pontiac phoenix'
381                 'ford fairmont futura'
382                       'amc concord dl'
383                  'volkswagen rabbit l'
384                   'mazda glc custom l'
385                     'mazda glc custom'
386               'plymouth horizon miser'
387                       'mercury lynx l'
388                     'nissan stanza xe'
389                         'honda accord'
390                       'toyota corolla'
391                          'honda civic'
392                   'honda civic (auto)'
393                        'datsun 310 gx'
394                'buick century limited'
395    'oldsmobile cutlass ciera (diesel)'
396           'chrysler lebaron medallion'
397                       'ford granada l'
398                     'toyota celica gt'
399                    'dodge charger 2.2'
400                     'chevrolet camaro'
401                      'ford mustang gl'
402                            'vw pickup'
403                        'dodge rampage'
404                          'ford ranger'
405                           'chevy s-10'
Name: Make, Length: 61, dtype: object